app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email])
    if user.present?
      if (params[:password] == user.password)
        token = SecureRandom.hex
        user.token = token
        user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "name@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "token" = ? WHERE "users"."id" = ?  [["updated_at", "2018-01-04 11:07:53.554806"], ["token", "9086a66a03c32ec25266a58e15cf0c91"], ["id", 2]]