app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    render json: { success: true, users: User.all }, status: 200

INSERT INTO "users" ("name", "email", "password", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "name@email.com"], ["updated_at", "2018-01-04 11:15:49.471665"], ["id", 2]]
---
  def update
    @user = User.find_by(id: params[:id])
    if @user.update_attributes(user_params)